In [1]:
import pandas as pd
people = pd.read_excel('People.xlsx', #header = 1, header = None)
print(people.shape)
#people.columns
#people.columns = ['ID', 'Type', 'Title', 'FirstName', 'MiddleName', 'LastName']
#people.to_excel('output.xlsx')
people.set_index('ID', inplace = True)
print(people.head(4))
print("======================")
people.tail(4)
                       
people = pd.read_excel('People.xlsx', index_col = 'ID')

(19972, 6)
   ID      Type Title FirstName MiddleName    LastName
0   1  Employee   NaN       Ken          J     Sánchez
1   2  Employee   NaN     Terri        Lee       Duffy
2   3  Employee   NaN   Roberto        NaN  Tamburello
3   4  Employee   NaN       Rob        NaN     Walters
======================

          ID                 Type Title FirstName MiddleName    LastName
19968  20774  Individual Customer   NaN  Isabella          F  Richardson
19969  20775  Individual Customer   NaN   Crystal          S          He
19970  20776  Individual Customer   NaN   Crystal        NaN       Zheng
19971  20777  Individual Customer   NaN   Crystal        NaN          Hu

In [1]:
import pandas as pd

In [2]:
people = pd.read_excel('People.xlsx', header = 1)
people.head(2)

   1  Employee NULL      Ken    J     Sánchez
0  2  Employee  NaN    Terri  Lee       Duffy
1  3  Employee  NaN  Roberto  NaN  Tamburello

In [3]:
people = pd.read_excel('People.xlsx')
people.head(2)

   ID      Type Title FirstName MiddleName LastName
0   1  Employee   NaN       Ken          J  Sánchez
1   2  Employee   NaN     Terri        Lee    Duffy

In [4]:
people.set_index('ID')
people.head(2)

   ID      Type Title FirstName MiddleName LastName
0   1  Employee   NaN       Ken          J  Sánchez
1   2  Employee   NaN     Terri        Lee    Duffy

In [5]:
people.set_index('ID',inplace =True)
people.head(2)

        Type Title FirstName MiddleName LastName
ID
1   Employee   NaN       Ken          J  Sánchez
2   Employee   NaN     Terri        Lee    Duffy